# SQL 3/3
> Cours NSI Terminale - Thème 2.

# Manipuler les données avec SQL

Dans ce dernier TP, nous allons voir comment insérer, mettre à jour ou supprimer des enregistrements dans des tables.

Commencez par valider les cellules suivantes afin d'activer la fonctionnalité SQL de Jupyter et de charger la base du TP précédent.

In [1]:
%load_ext sql

%sql sqlite:///livres_db

## Insérer un enregistrement dans une table

Nous avons déjà rencontré cerre requète **INSERT**. Elle s'applique que la table soit vide ou nom. On peut très bien ajouter par exemple une troisième langue dans notre table **Langues**

In [2]:
%sql INSERT INTO Langues (Langue) VALUES('Klingon');

 * sqlite:///livres_db
1 rows affected.

[]

In [3]:
# Vérifions :
%sql SELECT * FROM Langues;

 * sqlite:///livres_db
Done.

[(1, 'Anglais'), (2, 'Français'), (3, 'Klingon')]

## Mise a jour, effacement : UPDATE et DELETE

Les requêtes **UPDATE** et **DELETE** fonctionnent sur le même modèle que les requêtes **SELECT**.  Attention, on a vite fait d'effacer toutes ses données si on ne configure pas bien sa requête. Une bonne habitude à prendre est de tester d'abord ses critères à l'aide d'un **SELECT**.

Observez les exemples ci-dessous :

In [4]:
%sql SELECT NomAuteur FROM Auteurs WHERE IdAuteur = 10;

 * sqlite:///livres_db
Done.

[('Verne',)]

C'est bien lui !!

Modifions le nom de l'auteur grâce à une requête de mise à jour : 

**UPDATE** *table* <br>
**SET**  *attribut1* = *valeur1*, *attribut2* = *valeur2*, ...<br>
**WHERE** *critère*;

In [5]:
%%sql 

UPDATE Auteurs 
SET NomAuteur = "Ze Djloule", PrenomAuteur = "Juju"
WHERE IdAuteur=10;

SELECT * FROM Auteurs ;

 * sqlite:///livres_db
1 rows affected.
Done.

[(1, 'Orwell', 'George', 1, 1903),
 (2, 'Herbert', 'Frank', 1, 1920),
 (3, 'Asimov', 'Isaac', 1, 1920),
 (4, 'Huxley', 'Aldous', 1, 1894),
 (5, 'Bradbury', 'Ray', 1, 1920),
 (6, 'K. Dick', 'Philip', 1, 1928),
 (7, 'Barjavel', 'René', 2, 1911),
 (8, 'Boulle', 'Pierre', 2, 1912),
 (9, 'Van Vogt', 'Alfred Elton', 1, 1912),
 (10, 'Ze Djloule', 'Juju', 2, 1828)]

supprimons vite cette entrée ! Nous utiliserons une requête
**DELETE FROM** *table* **WHERE** *critere*

**Attention** : soyez bien sûr de votre critère sous peine de perdre des données importantes !

In [6]:
%%sql 

DELETE  FROM Auteurs  WHERE IdAuteur=10;

SELECT * FROM Auteurs;

 * sqlite:///livres_db
1 rows affected.
Done.

[(1, 'Orwell', 'George', 1, 1903),
 (2, 'Herbert', 'Frank', 1, 1920),
 (3, 'Asimov', 'Isaac', 1, 1920),
 (4, 'Huxley', 'Aldous', 1, 1894),
 (5, 'Bradbury', 'Ray', 1, 1920),
 (6, 'K. Dick', 'Philip', 1, 1928),
 (7, 'Barjavel', 'René', 2, 1911),
 (8, 'Boulle', 'Pierre', 2, 1912),
 (9, 'Van Vogt', 'Alfred Elton', 1, 1912)]

### Attention à la cohérence des données

Dans une base de données relationnelle il faut être vigilant lors de la suppression d'enregistrements : en effet la suppression d'un enregistrement entraîne la suppression de sa clé primaire qui peut être utilisée en tant que clé externe dans une autre table. Cela entraîne la corruption des données. Observez l'exemple ci-dessous dans lequel je me suis attribué un livre célèbre sans toucher à la table **Livres**

Il existe en SQL des moyens pour se prémunir de ce type de problèmes mais cela dépasse le cadre de ce cours.

In [7]:
%%sql
INSERT INTO Auteurs 
    (NomAuteur, PrenomAuteur, IdLangue, AnneeNaissance) 
VALUES
    ("Lecluse", "Olivier", 2, 1850);
    
SELECT Titre, NomAuteur from Livres JOIN Auteurs USING (IdAuteur);

 * sqlite:///livres_db
1 rows affected.
Done.

[('1984', 'Orwell'),
 ('Dune', 'Herbert'),
 ('Fondation', 'Asimov'),
 ('Le meilleur des mondes', 'Huxley'),
 ('Fahrenheit 451', 'Bradbury'),
 ('Ubik', 'K. Dick'),
 ('Chroniques martiennes', 'Bradbury'),
 ('La nuit des temps', 'Barjavel'),
 ('Blade Runner', 'K. Dick'),
 ('Les Robots', 'Asimov'),
 ('La Planète des singes', 'Boulle'),
 ('Ravage', 'Barjavel'),
 ('Le Maître du Haut Château', 'K. Dick'),
 ('Le monde des A', 'Van Vogt'),
 ('La Fin de l’éternité', 'Asimov'),
 ('De la Terre à la Lune', 'Lecluse')]

### A vous de jouer

1. Réinsérez l'auteur Jules Verne à sa place !
1. Supprimez tous les livres écrits au 19e sciecle

In [8]:
%%sql

DELETE  FROM Auteurs  WHERE IdAuteur=10;
INSERT INTO Auteurs 
    (NomAuteur, PrenomAuteur, IdLangue, AnneeNaissance) 
VALUES
    ("Verne", "Jules", 2, 1850);

 * sqlite:///livres_db
1 rows affected.
1 rows affected.

[]

In [12]:
result = %sql SELECT Titre, NomAuteur AnneePubli from Livres JOIN Auteurs USING (IdAuteur);
result

 * sqlite:///livres_db
Done.

[('1984', 'Orwell'),
 ('Dune', 'Herbert'),
 ('Fondation', 'Asimov'),
 ('Le meilleur des mondes', 'Huxley'),
 ('Fahrenheit 451', 'Bradbury'),
 ('Ubik', 'K. Dick'),
 ('Chroniques martiennes', 'Bradbury'),
 ('La nuit des temps', 'Barjavel'),
 ('Blade Runner', 'K. Dick'),
 ('Les Robots', 'Asimov'),
 ('La Planète des singes', 'Boulle'),
 ('Ravage', 'Barjavel'),
 ('Le Maître du Haut Château', 'K. Dick'),
 ('Le monde des A', 'Van Vogt'),
 ('La Fin de l’éternité', 'Asimov'),
 ('De la Terre à la Lune', 'Verne')]

In [13]:
assert len(result) == 16